const translate = require("../src/index");

describe("BTC currency tests", () => {
    it("следва да върне 'нула биткойна и нула сатоши'", () => {
        expect(translate.currency("00.00", { currency: "btc" })).toBe(
            "нула биткойна и нула сатоши"
        );
    });

    it("следва да върне 'един биткойн и едно сатоши'", () => {
        expect(translate.currency("1.01", { currency: "btc" })).toBe(
            "един биткойн и едно сатоши"
        );
    });

    it("следва да върне 'два биткойна и едно сатоши'", () => {
        expect(translate.currency("2.01", { currency: "btc" })).toBe(
            "два биткойна и едно сатоши"
        );
    });

    it("следва да върне 'два биткойна и десет сатоши'", () => {
        expect(translate.currency("2.1", { currency: "btc" })).toBe(
            "два биткойна и десет сатоши"
        );
    });

    it("следва да върне 'пет биткойна и петдесет и пет сатоши'", () => {
        expect(translate.currency("5.55", { currency: "btc" })).toBe(
            "пет биткойна и петдесет и пет сатоши"
        );
    });

    it("следва да върне 'пет биткойна и петдесет и пет сатоши'", () => {
        expect(translate.currency("5.55", { currency: "btc" })).toBe(
            "пет биткойна и петдесет и пет сатоши"
        );
    });

    it("следва да върне 'пет биткойна и нула сатоши'", () => {
        expect(translate.currency("5", { currency: "btc" })).toBe(
            "пет биткойна и нула сатоши"
        );
    });

    it("следва да върне 'нула биткойна и пет сатоши'", () => {
        expect(translate.currency("0.05", { currency: "btc" })).toBe(
            "нула биткойна и пет сатоши"
        );
    });

    it("следва да върне 'двеста и петнадесет хиляди, сто двадесет и осем биткойна и десет сатоши'", () => {
        expect(translate.currency("215128.1", { currency: "btc" })).toBe(
            "двеста и петнадесет хиляди, сто двадесет и осем биткойна и десет сатоши"
        );
    });

    it("следва да върне 'нула биткойна и двеста и осем хиляди сатоши'", () => {
        expect(translate.currency(".208000", { currency: "btc" })).toBe(
            "нула биткойна и двеста и осем хиляди сатоши"
        );
    });

});
