import translate from "../src/index.js";

describe("currency USD tests", () => {
    it("следва да върне 'нула долара и нула цента'", () => {
        expect(translate.currency("00.00", { currency: "usd" })).toBe(
            "нула долара и нула цента"
        );
    });

    it("следва да върне 'един долар и един цент'", () => {
        expect(translate.currency("1.01", { currency: "usd" })).toBe(
            "един долар и един цент"
        );
    });

    it("следва да върне 'триста и един долара и петдесет и един цента'", () => {
        expect(translate.currency("301.51", { currency: "usd" })).toBe(
            "триста и един долара и петдесет и един цента"
        );
    });

    it("следва да върне 'десет милиона, сто и петдесет хиляди, сто и два долара и деветдесет и два цента'", () => {
        expect(translate.currency("10150102.92", { currency: "usd" })).toBe(
            "десет милиона, сто и петдесет хиляди, сто и два долара и деветдесет и два цента"
        );
    });
});