const translate = require("../src/index");

describe("local currency tests", () => {
    it("следва да върне 'нула лева и нула стотинки'", () => {
        expect(translate.currency("00.00")).toBe("нула лева и нула стотинки");
    });

    it("следва да върне 'нула лева и нула стотинки'", () => {
        expect(translate.currency("00.009")).toBe("нула лева и нула стотинки");
    });

    it("следва да върне 'единадесет лева'", () => {
        expect(translate.currency("11", {displaySmall: false})).toBe("единадесет лева");
    });

    it("следва да върне 'единадесет стотинки'", () => {
        expect(translate.currency("0.11", {displayBig: false})).toBe("единадесет стотинки");
    });


    it("следва да върне 'един лев и една стотинка'", () => {
        expect(translate.currency("1.01")).toBe("един лев и една стотинка");
    });

    it("следва да върне 'два лева и десет стотинки'", () => {
        expect(translate.currency("2.1")).toBe("два лева и десет стотинки");
    });

    it("следва да върне 'пет лева и петдесет и пет стотинки'", () => {
        expect(translate.currency("5.55")).toBe("пет лева и петдесет и пет стотинки");
    });

    it("следва да върне 'петдесет и един лева и една стотинка'", () => {
        expect(translate.currency("51.01")).toBe("петдесет и един лева и една стотинка");
    });

    it("следва да върне 'два лева и нула стотинки'", () => {
        expect(translate.currency("2.00")).toBe("два лева и нула стотинки");
    });

    it("следва да върне 'нула лева и петдесет стотинки'", () => {
        expect(translate.currency("00.5")).toBe("нула лева и петдесет стотинки");
    });

    it("следва да върне 'четиристотин и една хиляди, петстотин петдесет и пет лева и дванадесет стотинки'", () => {
        expect(translate.currency("401555.12")).toBe(
            "четиристотин и една хиляди, петстотин петдесет и пет лева и дванадесет стотинки"
        );
    });

    it("следва да върне 'сто и една хиляди лева и деветдесет и девет стотинки'", () => {
        expect(translate.currency("101000.99")).toBe(
            "сто и една хиляди лева и деветдесет и девет стотинки"
        );
    });

    it("следва да върне 'две хиляди, четиридесет и осем лева плюс тридесет и две стотинки'", () => {
        expect(translate.currency("2048.32", { separator: " плюс " })).toBe(
            "две хиляди, четиридесет и осем лева плюс тридесет и две стотинки"
        );
    });

    it("следва да върне 'две хиляди и осемстотин лв. и осем ст.'", () => {
        expect(translate.currency("2800.08", { labelBig: "лв.", labelSmall: "ст." })).toBe(
            "две хиляди и осемстотин лв. и осем ст."
        );
    });

    it("следва да върне 'двадесет и една хиляди, петдесет и два лева и четири стотинки'", () => {
        expect(translate.currency("21052.04")).toBe(
            "двадесет и една хиляди, петдесет и два лева и четири стотинки"
        );
    });
});
