import translate from "../src/index.js";

describe("currency CNY tests", () => {
    it("следва да върне 'нула юана и нула фена'", () => {
        expect(translate.currency("00.00", { currency: "cny" })).toBe(
            "нула юана и нула фена"
        );
    });

    it("следва да върне 'един юан и един фен'", () => {
        expect(translate.currency("1.01", { currency: "cny" })).toBe(
            "един юан и един фен"
        );
    });

    it("следва да върне 'двадесет и една хиляди и един юана и петдесет и девет фена'", () => {
        expect(translate.currency("21001.59", { currency: "cny" })).toBe(
            "двадесет и една хиляди и един юана и петдесет и девет фена"
        );
    });

    it("следва да върне 'триста тридесет и три трилиона, сто и два милиарда, четиристотин деветдесет и осем милиона, деветстотин хиляди и двадесет юана и деветдесет и девет фена'", () => {
        expect(translate.currency("333102498900020.99", { currency: "cny" })).toBe(
            "триста тридесет и три трилиона, сто и два милиарда, четиристотин деветдесет и осем милиона, деветстотин хиляди и двадесет юана и деветдесет и девет фена"
        );
    });
});
