import translate from "../src/index.js";

describe("time tests", () => {
    it("следва да върне 'хиляда четиристотин шестдесет и пет дена'", () => {
        expect(translate.date("1465", { format: "d", separator: ", " })).toBe(
            "хиляда четиристотин шестдесет и пет дена"
        );
    });

    it("следва да върне 'един век, една година, един ден, един месец'", () => {
        expect(translate.date("1.1.1.1", { format: "a/y/d/m", separator: ", " })).toBe(
            "един век, една година, един ден, един месец"
        );
    });

    it("следва да върне 'две хиляда и една години, два дена, два месеца, два века'", () => {
        expect(translate.date("2001 2 2 2", { format: "Y.D.M.A", separator: ", " })).toBe(
            "две хиляди и една години, два дена, два месеца, два века"
        );
    });

    it("следва да върне 'два века, осем години, триста и един дена'", () => {
        expect(translate.date("2 8 301", { format: "a,y,d", separator: ", " })).toBe(
            "два века, осем години, триста и един дена"
        );
    });

    it("следва да върне 'две седмици и шест дена'", () => {
        expect(translate.date("2 6", { format: "w,d" })).toBe("две седмици и шест дена");
    });

    it("следва да върне 'пет хиляди века и двадесет и две години и един ден'", () => {
        expect(translate.date("5000 22 1", { format: "a/y/d" })).toBe(
            "пет хиляди века и двадесет и две години и един ден"
        );
    });

    it("следва да върне 'пет в. и двадесет и две г. и десет м. един д.'", () => {
        expect(
            translate.date("5 22 10 1", {
                format: "a/y/m/d",
                labels: { a: "в.", y: "г.", m: "м.", d: "д." },
            })
        ).toBe("пет в. и двадесет и две г. и десет м. и един д.");
    });
});
