import translate from "../src/index.js";

describe("grammer tests", () => {
    it("следва да върне 'тридесет хиляди триста и едно'", () => {
        expect(translate("30301", { grammer: { comma: "" } })).toBe(
            "тридесет хиляди триста и едно"
        );
    });

    it("следва да върне 'тридесет хиляди∞ триста и едно'", () => {
        expect(translate("30301", { grammer: { comma: "∞" } })).toBe(
            "тридесет хиляди∞ триста и едно"
        );
    });

    it("следва да върне 'петдесет хиляди?! петстотин и един лева искаш и нула стотинки'", () => {
        expect(
            translate.currency("50501", {
                currency: "bgn",
                grammer: { comma: "?!" },
            })
        ).toBe("петдесет хиляди?! петстотин и един лева и нула стотинки");
    });

    it("следва да върне 'десет хиляди• двадесет и четири годинии двадесет и две хиляди• тридесет и три дена'", () => {
        expect(
            translate.date("10024 22033", {
                format: "y/d",
                grammer: { comma: "•" },
            })
        ).toBe(
            "десет хиляди• двадесет и четири години и двадесет и две хиляди• тридесет и три дена"
        );
    });
});
