const translate = require("../src/index");

describe("main tests", () => {
    it("следва да върне 'едно'", () => {
        expect(translate("1")).toBe("едно");
    });

    it("следва да върне 'две'", () => {
        expect(translate("2")).toBe("две");
    });

    it("следва да върне 'сто и едно'", () => {
        expect(translate("101")).toBe("сто и едно");
    });

    it("следва да върне 'сто и единадесет'", () => {
        expect(translate("111")).toBe("сто и единадесет");
    });

    it("следва да върне 'хиляда сто и единадесет'", () => {
        expect(translate("1111")).toBe("хиляда сто и единадесет");
    });

    it("следва да върне 'две хиляди четиридесет и осем'", () => {
        expect(translate("2048")).toBe("две хиляди четиридесет и осем");
    });

    it("следва да върне 'дванадесет хиляди двадесет и пет'", () => {
        expect(translate("12025")).toBe("дванадесет хиляди двадесет и пет");
    });

    it("следва да върне 'петдесет и една хиляди и девет'", () => {
        expect(translate("51009")).toBe("петдесет и една хиляди и девет");
    });

    it("следва да върне 'осемстотин и една хиляди и едно'", () => {
        expect(translate("801001")).toBe("осемстотин и една хиляди и едно");
    });

    it("следва да върне 'деветстотин и един квадрилиона двеста и девет трилиона осемстотин и тринадесет милиарда триста петдесет и един милиона деветстотин осемдесет и две хиляди и единадесет'", () => {
        expect(translate("901209813351982011")).toBe("деветстотин и един квадрилиона двеста и девет трилиона осемстотин и тринадесет милиарда триста петдесет и един милиона деветстотин осемдесет и две хиляди и единадесет");
    });
});
