const translate = require("../src/index");

describe("main tests", () => {
    it("следва да върне 'нула'", () => {
        expect(translate("0")).toBe("нула");
    });

    it("следва да върне 'едно'", () => {
        expect(translate("1")).toBe("едно");
    });

    it("следва да върне 'две'", () => {
        expect(translate("2")).toBe("две");
    });

    it("следва да върне 'сто и едно'", () => {
        expect(translate("101")).toBe("сто и едно");
    });

    it("следва да върне 'сто и единадесет'", () => {
        expect(translate("111")).toBe("сто и единадесет");
    });

    it("следва да върне 'хиляда сто и единадесет'", () => {
        expect(translate("1111")).toBe("хиляда сто и единадесет");
    });

    it("следва да върне 'две хиляди, четиридесет и осем'", () => {
        expect(translate("2048")).toBe("две хиляди, четиридесет и осем");
    });

    it("следва да върне 'дванадесет хиляди, двадесет и пет'", () => {
        expect(translate("12025")).toBe("дванадесет хиляди, двадесет и пет");
    });

    it("следва да върне 'триста и една хиляди, петстотин осемдесет и едно'", () => {
        expect(translate("301581")).toBe("триста и една хиляди, петстотин осемдесет и едно");
    });

    it("следва да върне 'петдесет и една хиляди и девет'", () => {
        expect(translate("51009")).toBe("петдесет и една хиляди и девет");
    });

    it("следва да върне 'осемстотин и една хиляди и едно'", () => {
        expect(translate("801001")).toBe("осемстотин и една хиляди и едно");
    });

    it("следва да върне 'два милиона, четиристотин четиридесет и една хиляди'", () => {
        expect(translate("2441000")).toBe("два милиона, четиристотин четиридесет и една хиляди");
    });

    it("следва да върне 'осемстотин и един милиона, двеста и една хиляди'", () => {
        expect(translate("801201000")).toBe("осемстотин и един милиона, двеста и една хиляди");
    });

    it("следва да върне 'деветстотин и един квадрилиона, двеста и девет трилиона, осемстотин и тринадесет милиарда, триста петдесет и един милиона, деветстотин осемдесет и две хиляди и единадесет'", () => {
        expect(translate("901209813351982011")).toBe(
            "деветстотин и един квадрилиона, двеста и девет трилиона, осемстотин и тринадесет милиарда, триста петдесет и един милиона, деветстотин осемдесет и две хиляди и единадесет"
        );
    });

    it("следва да върне 'осемстотин и един квинтилиона, деветстотин деветдесет и два квадрилиона, триста четиридесет и девет трилиона, осемдесет и три милиарда, деветстотин тридесет и осем милиона, двеста двадесет и четири хиляди, петстотин петдесет и едно'", () => {
        expect(translate("801992349083938224551")).toBe(
            "осемстотин и един квинтилиона, деветстотин деветдесет и два квадрилиона, триста четиридесет и девет трилиона, осемдесет и три милиарда, деветстотин тридесет и осем милиона, двеста двадесет и четири хиляди, петстотин петдесет и едно"
        );
    });

    it("следва да върне 'хиляда'", () => {
        expect(translate("1000")).toBe("хиляда");
    });

    it("следва да върне 'двадесет и една хиляди'", () => {
        expect(translate("21000")).toBe("двадесет и една хиляди");
    });

    it("следва да върне 'един милион'", () => {
        expect(translate("1000000")).toBe("един милион");
    });

    it("следва да върне 'два милиона'", () => {
        expect(translate("2000000")).toBe("два милиона");
    });

    it("следва да върне 'един милиард'", () => {
        expect(translate("1000000000")).toBe("един милиард");
    });

    it("следва да върне 'два милиарда'", () => {
        expect(translate("2000000000")).toBe("два милиарда");
    });

    it("следва да върне 'един трилион'", () => {
        expect(translate("1000000000000")).toBe("един трилион");
    });

    it("следва да върне 'два трилиона'", () => {
        expect(translate("2000000000000")).toBe("два трилиона");
    });

    it("следва да върне 'един квадрилион'", () => {
        expect(translate("1000000000000000")).toBe("един квадрилион");
    });

    it("следва да върне 'два квадрилиона'", () => {
        expect(translate("2000000000000000")).toBe("два квадрилиона");
    });

    it("следва да върне 'един квинтилион'", () => {
        expect(translate("1000000000000000000")).toBe("един квинтилион");
    });

    it("следва да върне 'два квинтилиона'", () => {
        expect(translate("2000000000000000000")).toBe("два квинтилиона");
    });
});

describe("currency tests", () => {
    it("следва да върне 'нула лева и нула стотинки'", () => {
        expect(translate.currency("00.00")).toBe("нула лева и нула стотинки");
    });

    it("следва да върне 'един лев и една стотинка'", () => {
        expect(translate.currency("1.01")).toBe("един лев и една стотинка");
    });

    it("следва да върне 'пет лева и петдесет и пет стотинки'", () => {
        expect(translate.currency("5.55")).toBe("пет лева и петдесет и пет стотинки");
    });

    it("следва да върне 'петдесет и един лева и една стотинка'", () => {
        expect(translate.currency("51.01")).toBe("петдесет и един лева и една стотинка");
    });

    it("следва да върне 'два лева и нула стотинки'", () => {
        expect(translate.currency("2.00")).toBe("два лева и нула стотинки");
    });

    it("следва да върне 'четиристотин и една хиляди, петстотин петдесет и пет лева и дванадесет стотинки'", () => {
        expect(translate.currency("401555.12")).toBe(
            "четиристотин и една хиляди, петстотин петдесет и пет лева и дванадесет стотинки"
        );
    });

    it("следва да върне 'сто и една хиляди лева и деветдесет и девет стотинки'", () => {
        expect(translate.currency("101000.99")).toBe("сто и една хиляди лева и деветдесет и девет стотинки");
    });

    it("следва да върне 'две хиляди, четиридесет и осем лева плюс тридесет и две стотинки'", () => {
        expect(translate.currency("2048.32", { separator: " плюс " })).toBe(
            "две хиляди, четиридесет и осем лева плюс тридесет и две стотинки"
        );
    });

    it("следва да върне 'две хиляди и осемстотин лв. и осем ст.'", () => {
        expect(translate.currency("2800.08", { labelLv: "лв.", labelSt: "ст." })).toBe(
            "две хиляди и осемстотин лв. и осем ст."
        );
    });

    it("следва да върне 'двадесет и една хиляди, петдесет и два лева и четири стотинки'", () => {
        expect(translate.currency("21052.04")).toBe(
            "двадесет и една хиляди, петдесет и два лева и четири стотинки"
        );
    });
});
