import translate from "../src/index.js";

describe("various units' tests", () => {
    it("следва да върне 'хиляда и едно'", () => {
        expect(translate("1001")).toBe(
            "хиляда и едно"
        );
    });

    it("следва да върне 'хиляда и един километра'", () => {
        expect(translate("1001", { gender: "m" }) + " километра").toBe(
            "хиляда и един километра"
        );
    });

    it("следва да върне 'хиляда и два километра'", () => {
        expect(translate("1002", { gender: "m" }) + " километра").toBe(
            "хиляда и два километра"
        );
    });

    it("следва да върне 'сто и два километра'", () => {
        expect(translate("102", { gender: "m" }) + " километра").toBe(
            "сто и два километра"
        );
    });

    it("следва да върне 'една вилица'", () => {
        expect(translate("1", { gender: "f" }) + " вилица").toBe(
            "една вилица"
        );
    });

    it("следва да върне 'единадесет хиляди двеста и една наносекунди'", () => {
        expect(translate("11201", { gender: "f" }) + " наносекунди").toBe(
            "единадесет хиляди двеста и една наносекунди"
        );
    });

    it("следва да върне 'едно колело'", () => {
        expect(translate("1", { gender: "n" }) + " колело").toBe(
            "едно колело"
        );
    });

    it("следва да върне 'две колела'", () => {
        expect(translate("2", { gender: "n" }) + " колела").toBe(
            "две колела"
        );
    });

    it("следва да върне 'хиляда и едно'", () => {
        expect(translate("1001", { gender: "n" }) + " колела").toBe(            
            "хиляда и едно колела"
        );
    });
});
