 import translate from "../src/index.js";

describe("time tests", () => {
    it("следва да върне 'нула часа, нула минути и нула секунди'", () => {
        expect(translate.time("00:00:00")).toBe("нула часа, нула минути и нула секунди");
    });

    it("следва да върне 'нула часа, една минута и една секунда'", () => {
        expect(translate.time("00:01:01")).toBe("нула часа, една минута и една секунда");
    });

    it("следва да върне 'един час, две минути и петдесет и пет секунди'", () => {
        expect(translate.time("01:02:55")).toBe(
            "един час, две минути и петдесет и пет секунди"
        );
    });

    it("следва да върне 'десет часа, петдесет и девет минути и три секунди'", () => {
        expect(translate.time("10:59:03")).toBe(
            "десет часа, петдесет и девет минути и три секунди"
        );
    });

    it("следва да върне 'дванадесет часа и четиридесет и четири секунди'", () => {
        expect(translate.time("12:30:44", { displayMinute: false })).toBe(
            "дванадесет часа и четиридесет и четири секунди"
        );
    });

    it("следва да върне 'тридесет минути и четиридесет и четири секунди'", () => {
        expect(translate.time("12:30:44", { displayHour: false })).toBe(
            "тридесет минути и четиридесет и четири секунди"
        );
    });

    it("следва да върне 'дванадесет часа и тридесет минути'", () => {
        expect(translate.time("12:30:44", { displaySecond: false })).toBe(
            "дванадесет часа и тридесет минути"
        );
    });

    it("следва да върне 'дванадесет часа'", () => {
        expect(
            translate.time("12:30:44", { displayMinute: false, displaySecond: false })
        ).toBe("дванадесет часа");
    });

    it("следва да върне 'тридесет минути'", () => {
        expect(
            translate.time("12:30:44", { displayHour: false, displaySecond: false })
        ).toBe("тридесет минути");
    });

    it("следва да върне 'четиридесет и четири секунди'", () => {
        expect(
            translate.time("12:30:44", { displayMinute: false, displayHour: false })
        ).toBe("четиридесет и четири секунди");
    });

    it("следва да върне 'един часа и четири секунди'", () => {
        expect(
            translate.time("1:30:4", { displayMinute: false, labelHour: "часа" })
        ).toBe("един часа и четири секунди");
    });
});
